fredzo/esp32-gamepad-host/src/BluetoothManager.cpp
/*************************************************************************************************/
#include <Arduino.h>
#include <Esp32GamepadHost.h>
#include <BluetoothManager.h>

extern "C" {
#include <btstack.h>
#include "btstack_config.h"
#include "btstack_run_loop.h"
#ifdef ENABLE_LOG_INFO
#include "hci_dump.h"
#include "hci_dump_embedded_stdout.h"
#endif
extern void btstack_init();
}


/*************************************************************************************************/

#define L2CAP_CHANNEL_MTU              MAX_BT_DATA_SIZE

#define CLASS_OF_DEVICE_GAMEPAD_START  0x002500
#define CLASS_OF_DEVICE_GAMEPAD_END    0x0025FF
#define CLASS_OF_DEVICE_WIIMOTE        0x002504

// Reference to Esp32GamepadHost instance
static Esp32GamepadHost* gamepadHost;

/*************************************************************************************************/

static btstack_packet_callback_registration_t hci_event_callback_registration;

/*************************************************************************************************/

// App
enum BluetoothState {
    INIT,
    READY,
    CONNECTING,
    CONNECTED
};

static BluetoothState bluetoothState = INIT;
bool gapInquiryRunning = false;

////////////////// Gap Inquiry
#define INQUIRY_INTERVAL 5

static void start_scan(void){
    LOG_DEBUG("Starting inquiry scan..\n");
    uint8_t result = gap_inquiry_start(INQUIRY_INTERVAL);
    if(result != ERROR_CODE_SUCCESS) {
        LOG_ERROR("Inquiry failed, status 0x%02x\n", result);
    }
    else
    {
        gapInquiryRunning = true;
    }
}

static void restart_scan(void){
    if(gamepadHost->hasRemaingGamepadSlots())
    {
        start_scan();
    }
    else
    {
        gapInquiryRunning = false;
    }
}

//////////////////



/* @section Main application configuration
 *
 * @text In the application configuration, L2CAP is initialized 
 */

static void packet_handler (uint8_t packet_type, uint16_t channel, uint8_t *packet, uint16_t size);
static void handle_sdp_client_query_result(uint8_t packet_type, uint16_t channel, uint8_t *packet, uint16_t size);

static void hid_host_setup(void)
{
    // Initialize L2CAP 
    l2cap_init();

    // register L2CAP Services for reconnections
    l2cap_register_service(packet_handler, PSM_HID_INTERRUPT, 0xffff, gap_get_security_level());
    l2cap_register_service(packet_handler, PSM_HID_CONTROL, 0xffff, gap_get_security_level());

    // Allow sniff mode requests by HID device and support role switch
    gap_set_default_link_policy_settings(LM_LINK_POLICY_ENABLE_SNIFF_MODE | LM_LINK_POLICY_ENABLE_ROLE_SWITCH);

    // try to become master on incoming connections
    hci_set_master_slave_policy(HCI_ROLE_MASTER);

    // register for HCI events
    hci_event_callback_registration.callback = &packet_handler;
    hci_add_event_handler(&hci_event_callback_registration);

    // Disable stdout buffering
    setvbuf(stdin, NULL, _IONBF, 0);

#ifdef ENABLE_LOG_INFO
    hci_dump_init(hci_dump_embedded_stdout_get_instance());
#ifndef ENABLE_LOG_DEBUG    
    hci_dump_enable_packet_log(false);
    hci_dump_enable_log_level(HCI_DUMP_LOG_LEVEL_DEBUG,false);
#endif
#endif
}

/* @section SDP parser callback 
 * 
 * @text The SDP parsers retrieves the BNEP PAN UUID as explained in  
 * Section [on SDP BNEP Query example](#sec:sdpbnepqueryExample}.
 */

static void handle_sdp_client_query_result(uint8_t packet_type, uint16_t channel, uint8_t *packet, uint16_t size)
{
    UNUSED(packet_type);
    UNUSED(channel);
    UNUSED(size);

    uint8_t status;

    switch (hci_event_packet_get_type(packet))
    {
        case SDP_EVENT_QUERY_COMPLETE:
                Gamepad* connectingGamepad = gamepadHost->getConnectingGamepad();
                if(connectingGamepad == NULL)
                {
                    LOG_ERROR("ERROR : SDP query complete event received but no device is currently connecting...\n");
                    return;
                }
                status = l2cap_create_channel(packet_handler, connectingGamepad->address, PSM_HID_CONTROL, L2CAP_CHANNEL_MTU, &(connectingGamepad->l2capHidControlCid));
                LOG_DEBUG("SDP_EVENT_QUERY_COMPLETE l2cap_create_channel with device index %d for cid  0x%04x and address %s : status 0x%02x\n",connectingGamepad->index, connectingGamepad->l2capHidControlCid, bd_addr_to_str(connectingGamepad->address), status);
                if (status){
                    LOG_ERROR("Connecting to HID Control failed: 0x%02x\n", status);
                }
            break;
    }
}

static void do_connection_requests(void){
    Gamepad* gamepadToConnect = gamepadHost->askGamepadConnection();
    if(gamepadToConnect != NULL)
    {   // Connect to gamepad
        LOG_DEBUG("Connect to device for index %d.\n",gamepadToConnect->index);
        // Set security level according to gamepad
        gap_set_security_level(gamepadToConnect->isLowLevelSecurity() ? LEVEL_0 : LEVEL_2);  
        LOG_DEBUG("Start SDP HID query for remote HID Device with address=%s with %s security level.\n", bd_addr_to_str(gamepadToConnect->address), gamepadToConnect->isLowLevelSecurity() ? "LOW" : "HIGH");
        uint8_t status = sdp_client_query_uuid16(&handle_sdp_client_query_result, gamepadToConnect->address, BLUETOOTH_SERVICE_CLASS_HUMAN_INTERFACE_DEVICE_SERVICE);
        if (status == ERROR_CODE_SUCCESS) {
            bluetoothState = CONNECTING;
        } else {
            LOG_ERROR("Host connection failed, status 0x%02x\n", status);
        }
    }
}

static void sendReportCallback(void *cidParam) {
    uint16_t* cid = (uint16_t*)cidParam;
    LOG_DEBUG("Request can send for cid  %d.\n", (*cid));
    uint8_t result = l2cap_request_can_send_now_event((*cid));
}

void bluetoothManagerSendReport(Gamepad* gamepad, uint16_t* cid)
{
    if(gamepad == NULL)
    {
        LOG_ERROR("ERROR : sendOutputReport gamepad must not be NULL.\n");
        return;
    }
    // To prevent crashes when send report is called from the mail loop on core 1 while btstack_loop runs on core 0
    // we call the send report logic from a callback that will be executed in btstack_loop
    gamepad->sendReportCallback.callback = sendReportCallback;
    gamepad->sendReportCallback.context = cid;
    btstack_run_loop_execute_on_main_thread(&gamepad->sendReportCallback);
}

static void on_l2cap_incoming_connection(uint16_t channel, uint8_t* packet, uint16_t size)
{
    uint16_t local_cid, remote_cid;
    uint16_t psm;
    hci_con_handle_t handle;
    bd_addr_t address;

