fredzo/esp32-gamepad-host/src/BluetoothManager.cpp
    UNUSED(size);

    psm = l2cap_event_incoming_connection_get_psm(packet);
    handle = l2cap_event_incoming_connection_get_handle(packet);
    remote_cid = l2cap_event_incoming_connection_get_remote_cid(packet);
    local_cid = l2cap_event_channel_opened_get_local_cid(packet);
    l2cap_event_incoming_connection_get_address(packet,address);

    Gamepad* connectingGamepad = gamepadHost->getConnectingGamepad();
    if(connectingGamepad == NULL)
    {
        LOG_INFO("L2CAP channel open event received but no device is currently connecting : adding a new device\n");
        connectingGamepad = gamepadHost->addGamepad(address,Gamepad::State::CONNECTING);
    }

    LOG_DEBUG("L2CAP_EVENT_INCOMING_CONNECTION (psm=0x%04x, local_cid=0x%04x, "
    "remote_cid=0x%04x, handle=0x%04x, channel=0x%04x\n", psm, local_cid, remote_cid, handle, channel);
    if(gamepadHost->hasRemaingGamepadSlots())
    {   // Check that we have a free slot
        switch (psm)
        {
            case PSM_HID_CONTROL:
                connectingGamepad->l2capHidControlCid = channel;
                l2cap_accept_connection(channel);
                break;
            case PSM_HID_INTERRUPT:
                connectingGamepad->l2capHidInterruptCid = channel;
                l2cap_accept_connection(channel);
                break;
            default:
                LOG_ERROR("Unknown PSM = 0x%02x\n", psm);
        }
    }
    else
    {   // Decline connection if no slot availble
        l2cap_decline_connection(channel);
        LOG_INFO("No more slot available, declining connection for gamepad %s.\n",connectingGamepad->toString().c_str());
    }
}

static void on_l2cap_channel_closed(uint16_t channel, uint8_t* packet, int16_t size)
{
    uint16_t local_cid;

    UNUSED(size);

    local_cid = l2cap_event_channel_closed_get_local_cid(packet);
    LOG_DEBUG("L2CAP_EVENT_CHANNEL_CLOSED: 0x%04x (channel=0x%04x)\n", local_cid, channel);
    Gamepad* gamepad = gamepadHost->getGamepadForChannel(channel);
    if(gamepad != NULL)
    {
        LOG_INFO("Gamepad disconnected: %s.\n", gamepad->toString().c_str());
        if(!gamepadHost->gamepadDisconnected(gamepad))
        {   // No more gampads connected => go back to ready state
            bluetoothState = READY;
        }
        if(!gapInquiryRunning)
        {   // Go back to pairing mode
            start_scan();
        }
    }
}

static void on_l2cap_channel_opened(uint16_t channel, uint8_t* packet, uint16_t size)
{
    uint16_t psm;
    uint8_t status;
    uint16_t local_cid, remote_cid;
    uint16_t local_mtu, remote_mtu;
    hci_con_handle_t handle;
    bd_addr_t address;
    uint8_t incoming;

    UNUSED(size);

    LOG_DEBUG("L2CAP_EVENT_CHANNEL_OPENED (channel=0x%04x)\n", channel);

    l2cap_event_channel_opened_get_address(packet, address);
    status = l2cap_event_channel_opened_get_status(packet);
    if (status) {
        LOG_ERROR("L2CAP Connection failed: 0x%02x.\n", status);
        // Practice showed that if any of these two status are received, it is
        // best to remove the link key. But this is based on empirical evidence,
        // not on theory.
        if (status == L2CAP_CONNECTION_RESPONSE_RESULT_RTX_TIMEOUT ||
            status == L2CAP_CONNECTION_BASEBAND_DISCONNECT)
        {
            LOG_INFO("Removing previous link key for address=%s.\n",
            bd_addr_to_str(address));
            // Just in case the key is outdated we remove it. If fixes some
            // l2cap_channel_opened issues. It proves that it works when the status
            // is 0x6a (L2CAP_CONNECTION_BASEBAND_DISCONNECT).
            gap_drop_link_key_for_bd_addr(address);
        }
        return;
    }
    psm = l2cap_event_channel_opened_get_psm(packet);
    local_cid = l2cap_event_channel_opened_get_local_cid(packet);
    remote_cid = l2cap_event_channel_opened_get_remote_cid(packet);
    handle = l2cap_event_channel_opened_get_handle(packet);
    incoming = l2cap_event_channel_opened_get_incoming(packet);
    local_mtu = l2cap_event_channel_opened_get_local_mtu(packet);
    remote_mtu = l2cap_event_channel_opened_get_remote_mtu(packet);

    LOG_DEBUG(
    "PSM: 0x%04x, local CID=0x%04x, remote CID=0x%04x, handle=0x%04x, "
    "incoming=%d, local MTU=%d, remote MTU=%d\n",
    psm, local_cid, remote_cid, handle, incoming, local_mtu, remote_mtu);

    Gamepad* connectingGamepad = gamepadHost->getConnectingGamepad();
    if(connectingGamepad == NULL)
    {
        LOG_ERROR("ERROR : L2CAP channel open event received but no device is currently connecting...\n");
        return;
    }

    switch (psm)
    {
        case PSM_HID_CONTROL:
            connectingGamepad->l2capHidControlCid = l2cap_event_channel_opened_get_local_cid(packet);
            if(!incoming)
            {
                LOG_DEBUG("l2cap_create_channel PSM_HID_INTERRUPT");
                status = l2cap_create_channel(packet_handler, address, PSM_HID_INTERRUPT, L2CAP_CHANNEL_MTU, &(connectingGamepad->l2capHidControlCid));
                if (status)
                {
                    LOG_ERROR("Connecting to HID Control failed: 0x%02x\n", status);
                    break;
                }
            }
            break;

        case PSM_HID_INTERRUPT:
            connectingGamepad->l2capHidInterruptCid = l2cap_event_channel_opened_get_local_cid(packet);
            // Connection successfull
            bluetoothState = CONNECTED;
            gamepadHost->completeConnection(connectingGamepad);
            LOG_INFO("L2CAP interrupt channel open : connection complete fore gamepad %s.\n",connectingGamepad->toString().c_str());
            // Check for other connections
            do_connection_requests();
            break;
    }
}

/*
 * @section Packet Handler
 * 
 * @text The packet handler responds to various HCI Events.
 */
static void packet_handler (uint8_t packet_type, uint16_t channel, uint8_t *packet, uint16_t size)
{
    uint8_t   event;
    bd_addr_t event_addr;
    uint8_t   status;
    uint16_t vendorId;
    uint16_t productId;
    uint32_t classOfDevice;
    event = hci_event_packet_get_type(packet);
    Gamepad* gamepad;

    /* LISTING_RESUME */
    if (bluetoothState == INIT) {
        /* @text In INIT, an inquiry  scan is started, and the application transits to 
         * ACTIVE state.
         */
        switch(event){
            case BTSTACK_EVENT_STATE:
                if (btstack_event_state_get_state(packet) == HCI_STATE_WORKING){
                    start_scan();
                    bluetoothState = READY;
                }
                break;
            default:
                break;
        }
    }
    else
    {
        /* LISTING_RESUME */
        switch (packet_type)
        {
            case HCI_EVENT_PACKET:

                //LOG_DEBUG("HCI_EVENT_PACKET: 0x%02x\n", event);
                switch (event)
                {
                    case GAP_EVENT_INQUIRY_RESULT:
                        gap_event_inquiry_result_get_bd_addr(packet, event_addr);

