fredzo/esp32-gamepad-host/src/BluetoothManager.cpp
                        gamepad = gamepadHost->getGamepadForAddress(event_addr);
                        if (gamepad != NULL)
                        {   // already in our list
                            if(gamepad->state != Gamepad::State::CONNECTED)
                            {   // Ask for reconnection
                                gamepad->state = Gamepad::State::CONNECTION_REQUESTED;
                                do_connection_requests();
                            }
                        }
                        else
                        {
                            vendorId = gap_event_inquiry_result_get_device_id_vendor_id(packet);
                            productId = gap_event_inquiry_result_get_device_id_product_id(packet);
                            classOfDevice = gap_event_inquiry_result_get_class_of_device(packet);
                            if(classOfDevice >= CLASS_OF_DEVICE_GAMEPAD_START && classOfDevice <= CLASS_OF_DEVICE_GAMEPAD_END)
                            {   // Filter on gamepads
                                gamepad = gamepadHost->addGamepad(event_addr, 
                                Gamepad::State::CONNECTION_REQUESTED,
                                classOfDevice,vendorId,productId,
                                gap_event_inquiry_result_get_page_scan_repetition_mode(packet),
                                gap_event_inquiry_result_get_clock_offset(packet));

                                // print info
                                LOG_INFO("Device found: %s ",  bd_addr_to_str(event_addr));
                                LOG_INFO("with COD: 0x%06x, ", (unsigned int) classOfDevice);
                                LOG_INFO("vendorId: 0x%04x, ", vendorId);
                                LOG_INFO("productId: 0x%04x, ", productId);
                                LOG_INFO("pageScan %d, ",      gamepad->pageScanRepetitionMode);
                                LOG_INFO("clock offset 0x%04x",gamepad->clockOffset);
                                if (gap_event_inquiry_result_get_rssi_available(packet)){
                                    LOG_INFO(", rssi %d dBm", (int8_t) gap_event_inquiry_result_get_rssi(packet));
                                }
                                if (gap_event_inquiry_result_get_name_available(packet)){
                                    char name_buffer[240];
                                    int name_len = gap_event_inquiry_result_get_name_len(packet);
                                    memcpy(name_buffer, gap_event_inquiry_result_get_name(packet), name_len);
                                    name_buffer[name_len] = 0;
                                    LOG_INFO(", name '%s'", name_buffer);
                                }
                                LOG_INFO("\n");
                                do_connection_requests();
                            }
                        }   

                        break;

                    case GAP_EVENT_INQUIRY_COMPLETE:
                        LOG_DEBUG("Gap inquiry complete ! Starting a new scan...\n");
                        restart_scan();
                        break;

                    case HCI_EVENT_REMOTE_NAME_REQUEST_COMPLETE:
                        reverse_bd_addr(&packet[3], event_addr);
                        gamepad = gamepadHost->getGamepadForAddress(event_addr);
                        if (gamepad != NULL) {
                            if (packet[2] == 0) {
                                LOG_INFO("Name: '%s'\n", &packet[9]);
                            } else {
                                LOG_ERROR("Failed to get name: page timeout\n");
                            }
                        }
                        break;

                    /* LISTING_PAUSE */
                    case HCI_EVENT_PIN_CODE_REQUEST:
                        // inform about pin code request
                        LOG_INFO("Pin code request - using '0000'\n");
                        hci_event_pin_code_request_get_bd_addr(packet, event_addr);
                        gap_pin_code_response(event_addr, "0000");
                        break;

                    /* @text When BTSTACK_EVENT_STATE with state HCI_STATE_WORKING
                    * is received and the example is started in client mode, the remote SDP HID query is started.
                    */
                    case BTSTACK_EVENT_STATE:
                        if (btstack_event_state_get_state(packet) == HCI_STATE_WORKING)
                        {
                            LOG_DEBUG("[EVENT STATE] Start SDP HID query for remote HID Device with address=%s.\n", bd_addr_to_str(event_addr));
                        }
                        break;

                    case HCI_EVENT_USER_CONFIRMATION_REQUEST:
                        // inform about user confirmation request
                        LOG_DEBUG("SSP User Confirmation Request with numeric value '%" PRIu32 "'\n", little_endian_read_32(packet, 8));
                        LOG_DEBUG("SSP User Confirmation Auto accept\n");
                        break;

                    case HCI_EVENT_COMMAND_COMPLETE:
                    {
                        uint16_t opcode = hci_event_command_complete_get_command_opcode(packet);
                        const uint8_t* param = hci_event_command_complete_get_return_parameters(packet);
                        status = param[0];
                        LOG_DEBUG("--> HCI_EVENT_COMMAND_COMPLETE: opcode = 0x%04x - status=%d\n", opcode, status);
                        break;
                    }
                    case HCI_EVENT_AUTHENTICATION_COMPLETE_EVENT:
                    {
                        status = hci_event_authentication_complete_get_status(packet);
                        uint16_t handle = hci_event_authentication_complete_get_connection_handle(packet);
                        LOG_DEBUG("--> HCI_EVENT_AUTHENTICATION_COMPLETE_EVENT: status=%d, handle=0x%04x\n", status, handle);
                        break;
                    }

                    case HCI_EVENT_ROLE_CHANGE:
                        LOG_DEBUG("--> HCI_EVENT_ROLE_CHANGE\n");
                        break;

