fredzo/esp32-gamepad-host/src/BluetoothManager.cpp
                    case HCI_EVENT_CONNECTION_REQUEST:
                    {   // Incomming connection
                        hci_event_connection_request_get_bd_addr(packet, event_addr);
                        classOfDevice = hci_event_connection_request_get_class_of_device(packet);
                        LOG_DEBUG("--> HCI_EVENT_CONNECTION_REQUEST: link_type = %d, classOfDeviced = 0x%06x <--\n", hci_event_connection_request_get_link_type(packet),classOfDevice);
                        Gamepad* connectingGamepad = gamepadHost->getConnectingGamepad();
                        if(connectingGamepad == NULL)
                        {   // Create the gamepad and store class of device
                            LOG_INFO("HCI Connection request received but no device is currently connecting : adding a new device\n");
                            connectingGamepad = gamepadHost->addGamepad(event_addr,Gamepad::State::CONNECTING,classOfDevice);
                        }
                        break;
                    }

                    case HCI_EVENT_CONNECTION_COMPLETE: 
                    {
                        LOG_DEBUG("--> HCI_EVENT_CONNECTION_COMPLETE\n");
                        hci_event_connection_complete_get_bd_addr(packet, event_addr);
                        status = hci_event_connection_complete_get_status(packet);
                        if (status) {
                            LOG_ERROR("on_hci_connection_complete failed (0x%02x) for %s\n", status, bd_addr_to_str(event_addr));
                            return;
                        }
                        break;
                    }
                    
                    case L2CAP_EVENT_INCOMING_CONNECTION:
                        LOG_DEBUG("--> L2CAP_EVENT_INCOMING_CONNECTION\n");
                        on_l2cap_incoming_connection(channel, packet, size);
                        break;

                    case L2CAP_EVENT_CHANNEL_CLOSED:
                        on_l2cap_channel_closed(channel, packet, size);
                        break;

                    case L2CAP_EVENT_CHANNEL_OPENED: 
                        on_l2cap_channel_opened(channel, packet, size);
                        break;
                    case L2CAP_EVENT_CAN_SEND_NOW:
                    {
                        gamepad = gamepadHost->getGamepadForChannel(channel);
                        if(gamepad == NULL)
                        {
                            LOG_ERROR("ERROR : Received can send event for channel 0x%04x : no device found.\n",channel);
                            return;
                        }
                        // Prevent concurrent access to report information
                        xSemaphoreTake( gamepad->reportAccessMutex, portMAX_DELAY );
                        if(gamepad->report.reportType == Gamepad::ReportType::R_NONE)
                        {   // This can happen when a second report is sent on a gamepad before the first one has been sent (e.g. on fast led fading)
                            // When the first report is sent, the report type is set to NONE and then the second L2CAP_EVENT_CAN_SEND_NOW arrives
                            LOG_DEBUG("Received can send event for channel 0x%04x : report type NONE.\n",channel);
                        }
                        else
                        {
                            LOG_DEBUG("Sending output report of length %d for gamepad %s.\n",gamepad->report.reportLength,gamepad->toString().c_str());
                            l2cap_reserve_packet_buffer();
                            uint8_t * out_buffer = l2cap_get_outgoing_buffer();
                            out_buffer[0] = gamepad->report.reportHeader;
                            out_buffer[1] = gamepad->report.reportId;
                            if(gamepad->report.reportData && (gamepad->report.reportLength>0)) memcpy(out_buffer + 2, gamepad->report.reportData, gamepad->report.reportLength);
                            status = l2cap_send_prepared(channel,gamepad->report.reportLength + 2);
                            if(status)
                            {
                                LOG_ERROR("Error sending report on channel 0x%04x : status = (0x%02x).\n",channel,status);
                            }
                            gamepad->report.reportLength = 0;
                            gamepad->report.reportType = Gamepad::ReportType::R_NONE;
                        }
                        xSemaphoreGive(gamepad->reportAccessMutex);
                        break;
                    }

                    default:
                        break;
                }
                break;
            case L2CAP_DATA_PACKET:
                gamepad = gamepadHost->getGamepadForChannel(channel);
                if (gamepad != NULL)
                {
                    if(gamepad->parseDataPacket(packet,size))
                    {
                        gamepadHost->setLastCommand(gamepad->getCommand());
                        LOG_DEBUG("Gamepad DATA_PACKET ");
                        LOG_HEXDUMP(packet,size);
                    }
                }
                else
                {
                    LOG_DEBUG("L2CAP_DATA_PACKET ");
                    LOG_HEXDUMP(packet,size);
                }
            default:
                //LOG_DEBUG("Default for packet type: 0x%02x\n", event);
                break;
        }
    }
}


/*************************************************************************************************/

void bluetoothManagerRun(void)
{
    btstack_run_loop_execute();
}

int btStackMaxConnections;
void configuration_customizer(esp_bt_controller_config_t *cfg)
{
    cfg->bt_max_acl_conn = btStackMaxConnections;
}

/*************************************************************************************************/

int bluetoothManagerInit(int maxConnections)
{   // Store max copnnections param
    btStackMaxConnections = maxConnections;
    
    // Get reference to gamepadHost singleton instance
    gamepadHost = Esp32GamepadHost::getEsp32GamepadHost();

    // Configure BTstack
    btstack_init();
    // Register configuration customizr
    btstack_esp32_register_configuration_customizer(configuration_customizer);

    // Setup for HID Host
    hid_host_setup();

    // Turn on the device 
    hci_power_control(HCI_POWER_ON);

    return 0;
}